{
  "irVersion": "10",
  "producerName": "skl2onnx",
  "producerVersion": "1.19.1",
  "domain": "ai.onnx",
  "modelVersion": "0",
  "docString": "",
  "graph": {
    "node": [
      {
        "input": [
          "X"
        ],
        "output": [
          "cast_input"
        ],
        "name": "Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "cast_input",
          "coefficient"
        ],
        "output": [
          "mul_result"
        ],
        "name": "MatMul",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result",
          "intercepts"
        ],
        "output": [
          "add_result"
        ],
        "name": "Add",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result"
        ],
        "output": [
          "next_activations"
        ],
        "name": "Sigmoid",
        "opType": "Sigmoid",
        "domain": ""
      },
      {
        "input": [
          "next_activations",
          "coefficient1"
        ],
        "output": [
          "mul_result1"
        ],
        "name": "MatMul1",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result1",
          "intercepts1"
        ],
        "output": [
          "add_result1"
        ],
        "name": "Add1",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result1"
        ],
        "output": [
          "next_activations1"
        ],
        "name": "Sigmoid1",
        "opType": "Sigmoid",
        "domain": ""
      },
      {
        "input": [
          "next_activations1",
          "coefficient2"
        ],
        "output": [
          "mul_result2"
        ],
        "name": "MatMul2",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result2",
          "intercepts2"
        ],
        "output": [
          "add_result2"
        ],
        "name": "Add2",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result2"
        ],
        "output": [
          "next_activations2"
        ],
        "name": "Sigmoid2",
        "opType": "Sigmoid",
        "domain": ""
      },
      {
        "input": [
          "next_activations2",
          "coefficient3"
        ],
        "output": [
          "mul_result3"
        ],
        "name": "MatMul3",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result3",
          "intercepts3"
        ],
        "output": [
          "add_result3"
        ],
        "name": "Add3",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result3"
        ],
        "output": [
          "out_activations_result"
        ],
        "name": "Sigmoid3",
        "opType": "Softmax",
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "argmax_output"
        ],
        "name": "ArgMax",
        "opType": "ArgMax",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "output_probability"
        ],
        "name": "ZipMap",
        "opType": "ZipMap",
        "attribute": [
          {
            "name": "classlabels_int64s",
            "ints": [
              "0",
              "1",
              "2",
              "3",
              "4"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "classes",
          "argmax_output"
        ],
        "output": [
          "array_feature_extractor_result"
        ],
        "name": "ArrayFeatureExtractor",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "array_feature_extractor_result",
          "shape_tensor"
        ],
        "output": [
          "reshaped_result"
        ],
        "name": "Reshape",
        "opType": "Reshape",
        "domain": ""
      },
      {
        "input": [
          "reshaped_result"
        ],
        "output": [
          "label"
        ],
        "name": "Cast1",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "label"
        ],
        "output": [
          "output_label"
        ],
        "name": "Cast2",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      }
    ],
    "name": "ONNX(MLPClassifier)",
    "initializer": [
      {
        "dims": [
          "20",
          "128"
        ],
        "dataType": 1,
        "floatData": [
          0.19278932,
          0.35554758,
          0.20731919,
          -0.6725822,
          1.147658,
          -0.46951386,
          -1.4790215,
          0.36572656,
          -0.2816018,
          0.613593,
          -0.035074823,
          0.56422657,
          0.665019,
          -0.33834603,
          -0.16760458,
          -0.06490934,
          -0.29550564,
          -0.18751846,
          -0.28985137,
          0.9372602,
          -0.36267334,
          -0.21113625,
          0.38018957,
          0.021201957,
          -0.23544449,
          0.30155268,
          -0.07353295,
          -0.038714193,
          -0.33605963,
          0.3031206,
          0.17976063,
          -0.3438774,
          -0.84332275,
          -0.0048137647,
          0.8567112,
          -0.23574415,
          -0.76642996,
          0.7881733,
          -0.64010835,
          -0.5744933,
          -0.84589046,
          -0.555883,
          0.811583,
          -0.6372092,
          -0.33304563,
          0.050374847,
          -0.053490777,
          -0.38205948,
          0.035930365,
          -0.2883785,
          0.671933,
          0.09044004,
          0.160908,
          0.27535883,
          0.05455797,
          0.03061614,
          -0.09168802,
          1.5960289,
          -0.3862239,
          -0.14626426,
          -0.18632942,
          -0.38498262,
          0.42560422,
          0.37890747,
          -0.5483379,
          -0.5814138,
          -0.1511064,
          0.124276794,
          0.49450028,
          -0.28780988,
          -0.258124,
          0.28389952,
          -0.6562941,
          -0.65784836,
          -0.2911013,
          0.529121,
          0.34192443,
          -1.3199556,
          -0.88570744,
          0.10899062,
          0.3075801,
          0.42228547,
          0.44349316,
          0.69648534,
          0.24580044,
          -0.6740926,
          0.19745769,
          0.12900156,
          0.49116492,
          0.109340034,
          0.33237302,
          -1.1879636,
          0.018389747,
          0.8480895,
          -0.23888904,
          -0.48930132,
          1.0389835,
          0.15305112,
          -0.035088852,
          -1.4384315,
          0.2479631,
          -0.26061457,
          0.086949274,
          0.5502863,
          0.0137046315,
          0.3249791,
          -1.2724192,
          1.3127568,
          1.6002407,
          0.052456584,
          -1.3906236,
          -0.6880984,
          0.781234,
          0.38639882,
          -0.042540733,
          0.7211027,
          -0.85194725,
          0.18458049,
          0.82712,
          0.9635916,
          0.23980573,
          0.8919928,
          0.28926197,
          0.36225843,
          -0.12631497,
          0.6084716,
          -0.44914788,
          -0.34844464,
          0.55999064,
          0.11160624,
          -0.06375223,
          -0.15396866,
          0.5992226,
          -0.09375633,
          0.9277234,
          -0.19212048,
          -0.11250885,
          -0.013421616,
          -0.025022272,
          0.59853834,
          0.40214115,
          -0.46976835,
          0.2609218,
          -0.32521465,
          0.33278924,
          0.044214606,
          0.009191673,
          0.5249399,
          -0.6309648,
          -0.008052085,
          0.18089658,
          0.13074902,
          -0.9572769,
          -0.038171932,
          0.5913278,
          0.21945477,
          0.023576178,
          0.50454324,
          0.25834626,
          -0.53271127,
          -0.40846533,
          0.20854838,
          0.3939346,
          -0.6040343,
          -0.7511071,
          0.340367,
          -0.3626996,
          0.29035002,
          -0.6488587,
          0.09762334,
          -0.33822984,
          -0.55970234,
          0.06679831,
          0.25323835,
          -0.17790827,
          -0.35558257,
          0.3257383,
          0.5619276,
          0.80117553,
          0.09880992,
          0.7728714,
          -0.1407834,
          0.39867842,
          0.078801,
          -0.748342,
          0.30648455,
          0.30309847,
          -0.30009714,
          -0.6177622,
          -0.07573812,
          -0.63450766,
          0.48677787,
          0.47462833,
          -0.050698213,
          -0.14187549,
          0.5437963,
          0.06880288,
          -0.07977132,
          -0.040691137,
          0.61986583,
          -0.062524796,
          -0.68738127,
          -0.33252075,
          0.083516784,
          -0.14846863,
          -0.12992494,
          0.053433307,
          0.5337045,
          -0.702696,
          0.6236524,
          -0.16042636,
          0.21385942,
          1.1479341,
          -0.7146222,
          -0.29973733,
          -0.02718035,
          0.10111094,
          -0.44725013,
          0.1731494,
          0.53584886,
          -0.061634514,
          0.15902151,
          -0.13806972,
          -0.09499956,
          -0.060888298,
          -0.006696672,
          0.25325266,
          -0.47249582,
          1.1661855,
          -0.34738278,
          0.70614064,
          0.40614116,
          -0.5385378,
          -0.06501448,
          -0.31472313,
          0.59501815,
          -0.13447997,
          -0.19161934,
          0.17336024,
          -0.06388196,
          0.38282773,
          0.41551548,
          0.64762634,
          0.63804084,
          -0.28511775,
          -0.066381335,
          0.40094507,
          0.37419918,
          0.3232724,
          0.85460436,
          -0.3191019,
          -0.07546319,
          0.22836088,
          -0.01929835,
          -0.41861057,
          0.09780911,
          -0.5464016,
          -0.75648814,
          0.5048126,
          -0.40585512,
          -0.06100007,
          0.15184385,
          -0.58852226,
          0.1871761,
          0.29846308,
          -0.112322144,
          -0.4036744,
          -0.043985415,
          0.28968185,
          -0.39000094,
          -0.12528996,
          0.13690099,
          0.4251329,
          0.14476953,
          0.3597878,
          -0.0077675367,
          0.47125536,
          0.31621814,
          0.47389197,
          -0.017764118,
          0.7327853,
          -0.5142096,
          -0.51620626,
          -0.358531,
          -0.06689195,
          -0.16756845,
          -0.40443638,
          0.05549043,
          -0.13052414,
          0.2213015,
          0.022512153,
          1.1618961,
          -0.16948175,
          0.11086832,
          -0.37397698,
          -0.7683023,
          -0.2523852,
          -0.32684547,
          -0.058360413,
          -0.57335806,
          0.022653235,
          -0.6901223,
          -0.008205216,
          0.43659577,
          -0.08831034,
          0.37081727,
          -0.97604287,
          -0.55119586,
          -0.7010798,
          -0.76387405,
          -0.56027055,
          -0.2801255,
          0.89292175,
          0.41384444,
          0.12580943,
          0.024083259,
          0.12029811,
          -0.5005357,
          -0.025346668,
          -0.06888313,
          0.16325139,
          0.18879038,
          0.64572597,
          -0.5524252,
          0.21330965,
          0.6817368,
          0.25318775,
          -0.33587566,
          -0.02173421,
          -0.31062615,
          0.07925433,
          -0.22739898,
          -0.35809112,
          0.13714787,
          -0.053146973,
          -0.5751685,
          0.006800462,
          0.25615203,
          -1.022035,
          -0.8108134,
          -0.5726994,
          0.2762674,
          -0.5488475,
          -0.39104095,
          -1.5296364,
          0.8225784,
          -0.9687677,
          -0.0020844047,
          -0.4978536,
          -0.14141048,
          0.17357826,
          -0.36690396,
          0.13408357,
          -0.55395293,
          0.02271906,
          0.9141552,
          0.2746789,
          -0.10777774,
          -0.3623637,
          0.04027006,
          0.03095246,
          0.52371234,
          0.27459118,
          0.23236631,
          0.23600665,
          -0.50664467,
          0.115724884,
          0.22241957,
          0.18274122,
          0.20592381,
          -0.19149794,
          -0.123147614,
          -0.019112213,
          0.50630045,
          0.02174021,
          -0.97654897,
          -0.483106,
          0.12289627,
          -0.19624959,
          -0.30966848,
          -0.60132265,
          0.029164286,
          0.1440721,
          0.10764665,
          -0.36394584,
          -0.22245578,
          0.5043638,
          0.14237514,
          0.29078683,
          -0.03997941,
          0.6290208,
          0.6468755,
          0.02641879,
          0.23702003,
          0.10469533,
          1.058573,
          1.0853354,
          -0.93604493,
          0.20319726,
          0.10368161,
          0.66918886,
          -0.0070468658,
          -0.018655945,
          0.636281,
          -0.6100295,
          1.2399412,
          1.0411056,
          -0.4975836,
          0.6882207,
          -0.6255017,
          -0.32270584,
          0.078645736,
          -0.09823564,
          -0.45989314,
          0.0537275,
          -0.016412731,
          -0.7856725,
          0.05828586,
          0.44486287,
          0.87647516,
          -0.72444445,
          0.70482826,
          -1.3093712,
          -0.19976258,
          -0.6054097,
          -0.9837632,
          -0.14797473,
          -0.86219794,
          -0.69260186,
          -0.4475551,
          0.009257698,
          -0.48424718,
          -0.055528834,
          0.11059233,
          0.13004635,
          -0.14814404,
          -0.57543415,
          -0.114297174,
          -0.2698183,
          0.11905375,
          0.4755908,
          0.56840855,
          -0.003763223,
          0.2113877,
          0.20758325,
          -0.9012527,
          0.6208884,
          -0.28333563,
          -0.403569,
          -0.43474975,
          0.0027386092,
          -0.27391306,
          0.025791803,
          0.13244489,
          -0.06681522,
          -0.044345904,
          -0.6739827,
          -0.8166242,
          0.3609021,
          -0.011692408,
          -0.64251244,
          0.20484056,
          -0.36764127,
          0.030446658,
          0.0067148637,
          0.19947204,
          -0.04853966,
          0.57349056,
          -0.09494537,
          0.085777245,
          -0.5168168,
          0.15599363,
          -0.4658714,
          0.52260673,
          0.25611228,
          -0.15283643,
          0.24924919,
          0.3164143,
          0.42963615,
          -0.79386556,
          0.00071921304,
          -0.6369963,
          -0.08496377,
          0.48079443,
          0.3080273,
          0.051660527,
          -0.14557683,
          -0.03307651,
          0.39064795,
          0.43519604,
          -0.27963227,
          0.2719502,
          0.21494366,
          -0.045667533,
          -0.55329037,
          -0.7644019,
          0.9407918,
          0.9436745,
          -0.13833733,
          0.2777509,
          -0.93322337,
          0.39492473,
          0.3379494,
          0.81224173,
          -0.41583413,
          -0.14758626,
          0.14092761,
          -0.44567433,
          0.1444892,
          -0.13200329,
          0.07977099,
          -0.7522581,
          -0.24268535,
          0.13168429,
          -0.18845022,
          -0.053380735,
          0.62781614,
          0.86570907,
          1.0383514,
          0.32006493,
          0.55865675,
          -0.45848462,
          -1.1851046,
          0.31628826,
          0.21418568,
          -0.3051393,
          -0.91201377,
          0.17814618,
          0.79873085,
          0.8433743,
          1.0507807,
          0.08932018,
          1.1494921,
          0.7628643,
          0.34195438,
          0.5099919,
          0.9503257,
          -0.38002005,
          -1.2391037,
          -0.441474,
          0.9289377,
          -0.28377157,
          -0.6752541,
          0.27753043,
          -0.3431578,
          0.5585715,
          -0.33851275,
          0.41773924,
          -0.3955818,
          0.3246994,
          -0.70900077,
          -0.6401195,
          -0.5697407,
          -0.2840004,
          -0.23184417,
          -0.5608702,
          -0.20152847,
          -0.4325702,
          0.3946529,
          0.15906312,
          0.9012639,
          0.6803182,
          0.83812606,
          -0.76681155,
          -0.43796438,
          -0.45687133,
          -0.010820439,
          -0.50904024,
          0.82542485,
          -0.8297255,
          0.5890137,
          0.12682486,
          -0.1290951,
          -0.37229085,
          1.1479899,
          -0.09037363,
          0.22104494,
          0.60218924,
          -0.21337304,
          -0.5278641,
          -0.77937007,
          0.5767969,
          0.8949806,
          -0.3565398,
          -0.08559849,
          -0.44043216,
          -0.5308657,
          -0.90660435,
          -0.44041,
          0.015408338,
          -0.081579536,
          -0.42585248,
          -1.2817866,
          0.49285257,
          0.19123963,
          0.3934176,
          1.1334358,
          0.097506106,
          -0.7295281,
          -1.3403487,
          -0.24119636,
          1.0973177,
          -0.030116726,
          0.211729,
          -1.3534204,
          -0.75800306,
          0.3043579,
          -0.36710536,
          -0.3082386,
          -0.46760708,
          -1.465628,
          0.52247083,
          0.6023113,
          0.3450815,
          -0.3465377,
          0.04532063,
          -0.0576044,
          -0.19864792,
          0.3613427,
          0.5352047,
          -0.5265343,
          -0.82360077,
          -0.10810987,
          -0.31738886,
          0.31511724,
          0.12976615,
          1.0864766,
          0.23532154,
          -0.5396051,
          0.20042221,
          0.96979004,
          0.73747444,
          0.06842668,
          0.040859543,
          -0.40773153,
          -0.21693274,
          -0.62395066,
          -0.086358964,
          0.40575624,
          -0.4074606,
          -0.19474939,
          -1.0635161,
          0.00849326,
          -0.29178417,
          -0.9872381,
          -0.24678044,
          -1.4073253,
          -0.94770145,
          -0.48520127,
          -0.27916357,
          -0.05044087,
          -0.14626269,
          -0.04175035,
          0.23580799,
          0.40550187,
          -0.34327033,
          -0.6387415,
          -0.32869714,
          -0.8042236,
          0.4288524,
          -1.7822617,
          -0.30672327,
          -0.13587815,
          -0.53733623,
          -1.2195472,
          0.21929222,
          -0.78692883,
          0.17003956,
          -0.2495516,
          0.48208097,
          0.5206806,
          0.06554493,
          0.1844585,
          -0.21581094,
          0.18215123,
          0.6359617,
          0.53224057,
          -0.16116542,
          0.7838206,
          1.2869138,
          0.69351006,
          0.18783775,
          0.8138303,
          0.5762497,
          -0.060481604,
          -0.68404317,
          -0.45823243,
          -0.47393262,
          -0.79634714,
          -0.27543208,
          -0.52776957,
          -0.25071415,
          -0.42362785,
          -0.99052835,
          -0.76373,
          -0.2509725,
          0.018322181,
          1.7348069,
          -0.6239559,
          -0.11287818,
          -0.37369838,
          0.26166186,
          -1.3766918,
          0.432409,
          -0.30426094,
          -0.544804,
          -0.36946127,
          -0.2598537,
          -0.13770877,
          -0.6103635,
          -0.62843466,
          0.54390144,
          -0.20918657,
          0.28018337,
          0.15040107,
          -0.6201882,
          0.40225205,
          -0.22443485,
          -0.14542992,
          0.062672116,
          0.88720834,
          -0.22300586,
          -1.3674034,
          -0.56509864,
          -0.46163982,
          0.16234915,
          0.5271932,
          0.69955254,
          -1.2576059,
          -2.090686,
          -0.61558247,
          -0.5124658,
          0.34026876,
          0.64810854,
          -0.26369095,
          0.48565206,
          1.3669335,
          0.5144789,
          0.8547106,
          -0.099739015,
          -0.6768988,
          0.043748073,
          -0.05163526,
          0.18679509,
          -0.65202916,
          0.14569123,
          -0.8473545,
          -0.27751294,
          1.1475395,
          -0.24336316,
          -0.6255584,
          0.16358729,
          -0.14646757,
          -0.016731638,
          -1.2025461,
          -0.31725508,
          0.3094909,
          -0.14562486,
          -0.910203,
          -0.63097,
          -1.1210724,
          0.08965269,
          -0.63056314,
          0.67178047,
          -0.3379613,
          -0.034982562,
          0.05945716,
          0.19770569,
          1.178287,
          0.68169844,
          -0.4571776,
          0.53151226,
          -1.5524229,
          1.2890551,
          -0.5851446,
          1.0092494,
          0.2030093,
          0.9157458,
          0.027919117,
          0.3898394,
          0.9657656,
          -1.1474165,
          -0.43022898,
          0.7756883,
          1.0194952,
          1.5098006,
          0.70247173,
          0.5277822,
          -0.42814088,
          0.8224161,
          0.77573484,
          0.107394114,
          0.5136766,
          -1.2646593,
          0.4157278,
          -0.57340527,
          1.6757429,
          -1.2775784,
          -0.43377748,
          1.769244,
          -0.9926182,
          0.66566056,
          0.7833786,
          -1.2524778,
          -1.1644386,
          1.076297,
          -0.6536171,
          0.7139719,
          -0.18669431,
          -0.91319185,
          -0.9684625,
          -0.09309222,
          -0.89202946,
          0.69686496,
          -0.44184387,
          -0.78002447,
          -0.13240276,
          1.2040507,
          -0.33072326,
          0.20727424,
          1.4156739,
          -0.22861126,
          0.7204327,
          -0.4015082,
          -1.4719056,
          0.46676967,
          1.0399133,
          -0.6953511,
          0.23912342,
          -1.123365,
          -0.68438846,
          -1.4722044,
          -1.3870267,
          -0.7970147,
          0.7053513,
          1.2427559,
          0.824968,
          0.65982306,
          1.0541131,
          -0.56481206,
          -0.9349322,
          -1.141842,
          -0.38373318,
          1.1611512,
          -1.2479806,
          -0.27941257,
          -1.2691538,
          1.2958066,
          -0.8671437,
          -1.8262235,
          -0.012566852,
          -0.08233649,
          -0.22170278,
          1.6897979,
          -1.4426081,
          0.19011232,
          0.08551571,
          -0.5275942,
          -0.21154898,
          -1.1163821,
          -0.21182112,
          0.73320615,
          1.2132837,
          -1.149429,
          -0.49180207,
          -1.0739883,
          0.6378742,
          -1.5175726,
          -0.27712995,
          1.9715034,
          1.03238,
          -1.4030125,
          -0.81930846,
          -0.13554223,
          -0.7604212,
          -1.85533,
          1.4886197,
          0.009983009,
          -1.4000907,
          -1.060744,
          0.7847634,
          0.9052356,
          0.576894,
          -1.4776152,
          -0.94402665,
          -0.44427422,
          -0.96475154,
          -0.31122398,
          0.59112394,
          -2.6296957,
          0.98181105,
          -1.1717114,
          -0.23829326,
          -1.4795003,
          1.6422174,
          -1.052274,
          -0.43650675,
          0.25452903,
          1.8585612,
          -0.22521652,
          0.065132976,
          -0.2093445,
          -0.7327643,
          0.0689195,
          0.432878,
          1.2009685,
          -0.31582376,
          -0.17917097,
          -0.18443625,
          0.037646033,
          -0.82368976,
          -0.23668782,
          0.46593258,
          -0.07427332,
          -0.3707437,
          -0.79184616,
          0.41204214,
          0.21362633,
          0.23626733,
          -0.86874825,
          -0.1524985,
          -0.28619567,
          0.5338901,
          -0.42084402,
          -0.4489657,
          -0.045636237,
          -0.3580596,
          -0.51465094,
          0.31423563,
          0.047888394,
          -0.39820382,
          -0.26356453,
          0.6464367,
          -0.20886761,
          -0.26025826,
          -0.5238248,
          -0.30042696,
          -0.1085787,
          0.65059155,
          -0.40410674,
          -0.629353,
          0.63253033,
          0.015689366,
          0.2666551,
          -0.8872442,
          0.052773725,
          -0.27247822,
          -0.67426986,
          0.5265897,
          0.32380226,
          0.29969087,
          0.01553241,
          -1.1445264,
          -0.22214332,
          -0.111374594,
          1.4032407,
          -0.5151176,
          -0.6139225,
          -0.6206792,
          0.026590299,
          -0.045557998,
          -0.24340475,
          -1.0550411,
          0.6598732,
          0.18408729,
          -0.9569458,
          -0.4671206,
          -0.0430441,
          -0.007683222,
          0.31866613,
          0.43791234,
          1.6065757,
          -0.05204376,
          0.5083294,
          -0.059962943,
          -0.20950218,
          -0.5784974,
          0.22540893,
          0.16663264,
          0.8423434,
          -0.35957965,
          -0.23289873,
          -0.43464047,
          -0.5395172,
          0.7939379,
          0.06726965,
          1.7832259,
          -0.16744651,
          -0.38121426,
          0.12514214,
          -0.056678902,
          -0.30945775,
          1.0136137,
          -0.5944096,
          -0.14810796,
          -0.35251376,
          -0.020741511,
          -0.49537593,
          -0.49373794,
          0.06423117,
          -1.0394,
          1.3085942,
          1.423362,
          0.17109361,
          -0.6483624,
          -0.42698365,
          0.9802786,
          -0.14396721,
          -0.30196038,
          -0.36034223,
          -0.21166481,
          0.3552416,
          0.047164515,
          2.3631961,
          -0.31060743,
          0.19617195,
          0.24464351,
          0.6152115,
          1.0823045,
          0.029730374,
          -1.3924038,
          0.0210204,
          -0.25865,
          -0.24561806,
          0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          -0.0,
          -0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          -0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          0.0,
          -0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          0.0,
          0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          -0.0,
          -0.0,
          -0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          0.9790575,
          0.13872351,
          -1.3786125,
          -0.32858256,
          -0.13364425,
          -0.257141,
          -0.09785763,
          -0.2409806,
          -1.009873,
          -0.41482037,
          1.0144087,
          -0.26959908,
          -0.5825997,
          0.7518428,
          1.0619711,
          -0.4295836,
          -0.90114295,
          -0.8088412,
          -0.2495227,
          0.3082,
          -0.27697036,
          -0.3496679,
          -0.6082591,
          0.82487816,
          0.44204706,
          0.84904784,
          0.5806166,
          0.9491485,
          -0.20218493,
          0.61903745,
          0.6455608,
          0.2983653,
          0.34169862,
          -0.79914236,
          -0.2078887,
          -0.397999,
          0.3992301,
          -0.42958537,
          0.5114622,
          0.19301666,
          0.48795873,
          0.3591939,
          0.6532449,
          0.51137084,
          0.6637436,
          0.038744897,
          -0.48119134,
          0.23240322,
          0.41539988,
          -0.9186704,
          -0.3490077,
          1.2588408,
          0.5155734,
          1.2018697,
          0.30013287,
          0.95884407,
          -0.20324227,
          0.56814677,
          -0.81518286,
          -1.1561898,
          0.22927828,
          0.7845411,
          0.39995763,
          0.65190506,
          0.4447378,
          0.28604594,
          -0.003789012,
          0.08513658,
          -0.32112774,
          -0.18124588,
          0.0606767,
          0.23898534,
          0.45481572,
          0.6647287,
          -0.75052583,
          -0.117337786,
          0.7659698,
          -0.76984066,
          0.5620862,
          0.51043344,
          1.129217,
          0.07218599,
          0.63286453,
          -0.07202723,
          -0.3422662,
          0.17481875,
          0.9319119,
          0.68157935,
          0.32826254,
          0.3465344,
          0.32770222,
          0.5496358,
          1.0093137,
          -0.23330143,
          -0.6076246,
          0.8343886,
          0.49960592,
          0.6591085,
          -0.21994925,
          -0.52874184,
          -0.07707853,
          -0.01847086,
          0.991502,
          0.6349292,
          0.49699318,
          -1.209589,
          -0.5629843,
          0.077295125,
          0.48326614,
          1.1273822,
          -0.41275495,
          0.44007808,
          -0.36936218,
          -0.5930465,
          -0.6499478,
          -0.1557087,
          0.36671636,
          -1.4516373,
          0.23825517,
          -0.15327378,
          0.03094107,
          -0.14460778,
          -0.48318917,
          0.87979114,
          1.3224545,
          0.67330223,
          -0.013358843,
          0.62696034,
          0.29160622,
          0.05944578,
          -0.44219574,
          0.19276044,
          -0.2749271,
          0.076388866,
          0.23781879,
          0.2660795,
          -0.21695608,
          0.12833315,
          0.27420467,
          0.23441328,
          -0.06066276,
          0.18628359,
          0.069537446,
          0.03857281,
          -0.054106727,
          -0.025218982,
          0.13497303,
          0.29574665,
          -0.07409202,
          0.14085874,
          0.015607768,
          0.14178221,
          0.469385,
          0.15535101,
          0.267611,
          0.09391748,
          0.19598779,
          -0.064324096,
          0.08439648,
          0.34879434,
          -0.09364535,
          -0.21935177,
          0.30818638,
          -0.18941765,
          0.0036008009,
          -0.07322672,
          0.17970213,
          -0.08441435,
          0.4864405,
          -0.10467252,
          0.19453812,
          0.3547278,
          0.14313944,
          0.036562696,
          0.08938018,
          -0.06401217,
          0.0919863,
          -0.1560797,
          -0.21550724,
          0.3304339,
          0.29553193,
          0.5453054,
          -0.040919237,
          0.3619502,
          -0.2675213,
          0.40817568,
          0.022326699,
          -0.23923613,
          0.37545046,
          0.20759489,
          -0.1137094,
          -0.041126464,
          0.0576914,
          -0.17757836,
          0.1453497,
          0.37066424,
          0.08080019,
          0.2676413,
          0.3086311,
          -0.062617354,
          0.037758905,
          0.044736054,
          -0.030717278,
          0.1812765,
          -0.022524107,
          -0.04210124,
          0.040146627,
          0.3403826,
          0.21933001,
          -0.19520508,
          0.29227385,
          0.18631473,
          0.025070395,
          0.22611983,
          0.20464891,
          0.10143376,
          0.15889774,
          0.19492684,
          0.36837938,
          0.16222,
          0.30513558,
          0.1408139,
          -0.09027603,
          0.06955767,
          0.21028113,
          -0.0041507552,
          0.25698882,
          -0.17388366,
          0.048749644,
          0.30736086,
          0.42469996,
          0.14416943,
          -0.045083046,
          -0.35889035,
          -0.24551907,
          -0.24505825,
          0.49951118,
          0.38048375,
          -0.52851033,
          0.10111798,
          0.11130195,
          0.023721017,
          0.014117405,
          -0.3967748,
          -0.17084658,
          -0.40142843,
          -0.085198596,
          0.053549413,
          0.090788454,
          -0.28660527,
          -0.01268182,
          0.2123541,
          0.37239447,
          0.0014132726,
          0.14853482,
          -0.113782585,
          0.45730287,
          0.36624476,
          -1.1283735,
          -0.49724755,
          0.6454636,
          -0.51769125,
          0.1030386,
          -0.17328067,
          -0.3284081,
          0.28074336,
          0.26466918,
          0.26756662,
          0.029494138,
          -0.12030196,
          0.5299891,
          -0.6537217,
          0.28055385,
          -0.1261118,
          -0.4796035,
          0.1265163,
          0.060113322,
          0.32948944,
          0.16960052,
          0.78626657,
          -0.7522855,
          -0.13346179,
          0.109242335,
          0.29882687,
          -0.40178925,
          0.032554522,
          0.28229043,
          -0.6835769,
          -0.2033754,
          -0.49250478,
          0.23228832,
          -0.91970044,
          -0.24339992,
          0.23447427,
          -0.37542665,
          0.12778859,
          -0.5458989,
          -0.17456308,
          0.023285225,
          -0.33052838,
          -0.27033186,
          0.3201596,
          -0.57532233,
          -0.3782742,
          0.61201644,
          -0.22530608,
          0.6677225,
          0.17644273,
          0.73964936,
          0.21768863,
          0.34479475,
          0.53812975,
          -0.8952002,
          -0.101901196,
          -0.2894757,
          -0.79509604,
          -0.82181174,
          -0.24766487,
          -0.39004207,
          0.12833412,
          -0.058829382,
          -0.20723642,
          -0.7751277,
          0.6332791,
          0.10946208,
          -0.4552405,
          -0.6093348,
          0.5211927,
          -0.31803244,
          -0.26283902,
          -0.7863865,
          0.37563846,
          -0.104068846,
          -0.6745296,
          -0.19788049,
          0.58780736,
          -0.16091019,
          0.6491563,
          0.14938708,
          0.5031332,
          0.608295,
          -0.73388,
          -0.20157841,
          0.18184245,
          0.027698182,
          -0.2583946,
          0.19789973,
          -0.25446773,
          -0.0044973157,
          0.12005724,
          -0.05522861,
          -0.17404228,
          -0.14398041,
          -0.05242601,
          0.11272513,
          -0.738826,
          0.4462346,
          -0.51804554,
          0.5166257,
          0.3208655,
          -0.3723994,
          -0.657985,
          -0.42381427,
          0.5486424,
          -0.43079972,
          0.3583957,
          -0.45006737,
          -0.21390453,
          0.21855396,
          0.05737272,
          -0.1328132,
          0.5092663,
          -0.35108927,
          -0.91388667,
          0.4699956,
          0.60984635,
          0.39990023,
          0.32198635,
          0.084470354,
          0.22365355,
          0.45379353,
          0.31108415,
          -0.36973283,
          -0.26039082,
          0.5741381,
          0.39659017,
          -1.1493962,
          -0.36545888,
          0.59080535,
          -0.48903075,
          0.083645895,
          -0.15996684,
          -0.29570043,
          0.30572236,
          0.4110861,
          0.22732562,
          -0.018150577,
          -0.11625277,
          0.5387637,
          -0.697908,
          0.16548266,
          -0.09559762,
          -0.50066745,
          0.20419344,
          0.13182104,
          0.39678237,
          0.17982508,
          0.6696157,
          -0.88637966,
          0.015416861,
          0.06936349,
          0.468384,
          -0.59195936,
          0.01776739,
          0.38719124,
          -0.7673852,
          -0.30716738,
          -0.61017007,
          0.26388136,
          -0.7218372,
          -0.18514003,
          0.10692614,
          -0.41329595,
          0.18765354,
          -0.42957422,
          -0.25668103,
          0.014117285,
          -0.41639602,
          -0.1239786,
          0.40269107,
          -0.60761106,
          -0.4123726,
          0.5505029,
          -0.20588309,
          0.6865487,
          0.33384097,
          0.6628626,
          0.3034246,
          0.41894478,
          0.51146483,
          -0.8095878,
          -0.21057467,
          -0.3981938,
          -0.8626972,
          -0.67322576,
          -0.25346547,
          -0.47859338,
          0.15423286,
          0.17873178,
          -0.016051522,
          -0.71552575,
          0.645287,
          0.154664,
          -0.6337538,
          -0.6419486,
          0.7635756,
          -0.21399432,
          -0.29540703,
          -0.8232598,
          0.24219224,
          0.015434855,
          -0.4806425,
          -0.037665006,
          0.36727282,
          -0.29772958,
          0.7038368,
          0.17834876,
          0.5065475,
          0.7161257,
          -0.8704127,
          -0.17234859,
          0.2304233,
          0.056494407,
          -0.4017606,
          0.53463763,
          -0.08479569,
          0.42937985,
          0.00029848915,
          -0.28033033,
          -0.09300399,
          -0.15491547,
          -0.021292506,
          -0.053382084,
          -0.55016583,
          0.457378,
          -0.56843305,
          0.4393029,
          0.30079392,
          -0.43076122,
          -0.7858857,
          -0.30667275,
          0.610131,
          -0.3364512,
          0.4792556,
          -0.27983305,
          -0.26510027,
          0.17932408,
          -0.0683897,
          -0.019532928,
          0.7240866,
          -0.37844586,
          -0.8075686,
          0.5946388,
          0.65702254,
          0.404813,
          0.43997595,
          0.047997896,
          0.2894846,
          0.4262552,
          0.4142973,
          -0.63637924,
          -0.1534666,
          0.029601837,
          -0.23015532,
          -0.2565015,
          -0.09614913,
          -0.39699334,
          -0.057442915,
          -0.5875903,
          -0.8980092,
          0.04702446,
          -0.06977934,
          0.030164752,
          -0.37406185,
          -0.6897295,
          0.8144334,
          0.2965414,
          -0.1518738,
          -0.0023412227,
          -0.12806563,
          0.21538469,
          -0.23464778,
          0.48503247,
          -0.34305146,
          -0.49596792,
          0.366184,
          0.1768248,
          0.53274,
          0.022281779,
          0.22726645,
          0.044045147,
          0.51673615,
          0.17548065,
          0.026645362,
          0.7089646,
          -0.12801991,
          -0.73141336,
          0.5524506,
          1.0772623,
          -0.5858193,
          0.21261145,
          -0.18052007,
          0.5468034,
          0.53281045,
          0.86310816,
          0.11542763,
          0.2689682,
          -0.20029315,
          0.15291731,
          0.46364048,
          0.41628253,
          -0.20086998,
          1.0574672,
          0.06488743,
          -0.03653159,
          -0.17187087,
          -0.055796128,
          0.17882699,
          0.37182108,
          0.7016499,
          -0.2203836,
          0.0018084073,
          0.24399312,
          0.36267695,
          0.27383566,
          0.4211763,
          0.60261685,
          0.28169566,
          0.45376664,
          -0.20269342,
          -0.50482213,
          0.37121737,
          0.07830651,
          0.0661064,
          0.5412311,
          0.79427636,
          -0.25017115,
          0.043760538,
          0.54731935,
          -0.18564612,
          0.6558952,
          -0.18189174,
          -0.6519614,
          0.4951753,
          0.025510479,
          0.87900853,
          0.8164605,
          0.07763887,
          0.25694832,
          -0.042095564,
          -0.29006964,
          0.42809108,
          0.8268334,
          0.47955453,
          -0.02483042,
          -0.37334567,
          -0.7410555,
          0.45111614,
          0.7132002,
          0.43795836,
          -0.66956794,
          0.09877712,
          0.971947,
          0.03975439,
          -0.03238563,
          0.68928367,
          0.17124309,
          -0.13727942,
          0.058354117,
          0.33909413,
          0.0907679,
          -0.04236713,
          -0.08412591,
          0.3253668,
          -0.5098821,
          -0.77015513,
          0.36624807,
          -0.2870233,
          0.44147047,
          -0.13588478,
          0.31142092,
          1.0099856,
          -0.09529802,
          -0.11835008,
          -0.2796826,
          0.5923221,
          0.23732093,
          0.5854121,
          -0.004789681,
          0.40131816,
          0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          0.0,
          -0.0,
          0.0,
          0.0,
          0.0,
          -0.0,
          -0.0,
          0.0,
          -0.017900404,
          -0.57594156,
          0.85797864,
          0.25266254,
          -0.2038186,
          -0.28006604,
          -0.107009284,
          -0.30328113,
          0.29943314,
          -0.27936858,
          0.22738655,
          0.2938866,
          -0.115085684,
          -0.17820522,
          0.29442677,
          -0.18055381,
          -0.23941647,
          -0.3157678,
          -0.2907911,
          -0.058837418,
          0.21966629,
          -0.14038718,
          0.25550932,
          -0.46676913,
          -0.62285733,
          0.056581687,
          0.3962877,
          0.17752941,
          -0.5605976,
          -0.03606739,
          0.25483355,
          -0.56876546,
          -0.33232808,
          -0.1871591,
          0.17649318,
          0.5216049,
          -0.1366489,
          0.20865119,
          -0.38069326,
          -0.12898548,
          -0.1258593,
          -0.33663318,
          0.25130135,
          -0.4803581,
          -0.43258277,
          -0.46325085,
          0.2505959,
          -0.027302284,
          -0.31130245,
          -0.10963314,
          -0.33537275,
          -0.050421383,
          0.16936927,
          -0.06365612,
          -0.46089235,
          0.15915161,
          0.64113194,
          -0.0914953,
          -0.16252352,
          0.59912753,
          -0.27011096,
          -0.208278,
          -0.5265819,
          -0.08138414,
          -0.25931853,
          0.103295095,
          -0.14992997,
          -0.042431816,
          -0.11874597,
          -0.39679018,
          -0.5022446,
          0.40074405,
          -0.08270305,
          -0.114471994,
          0.5350363,
          -0.25101992,
          0.13791119,
          0.34471124,
